In [127]:
import pandas as pd
from sklearn import tree
from sklearn.preprocessing import LabelEncoder
from sklearn.model_selection import train_test_split
from sklearn.metrics import accuracy_score

In [4]:
df = pd.read_csv("titanic.csv")

In [62]:
df

     Survived  Pclass     Sex   Age     Fare
0           0       3    male  22.0   7.2500
1           1       1  female  38.0  71.2833
2           1       3  female  26.0   7.9250
3           1       1  female  35.0  53.1000
4           0       3    male  35.0   8.0500
..        ...     ...     ...   ...      ...
885         0       3  female  39.0  29.1250
886         0       2    male  27.0  13.0000
887         1       1  female  19.0  30.0000
889         1       1    male  26.0  30.0000
890         0       3    male  32.0   7.7500

[712 rows x 5 columns]

In [63]:
df.info()#displays information about the dataset

<class 'pandas.core.frame.DataFrame'>
Int64Index: 712 entries, 0 to 890
Data columns (total 5 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   Survived  712 non-null    int64
 1   Pclass    712 non-null    int64
 2   Sex       712 non-null    object
 3   Age       712 non-null    float64
 4   Fare      712 non-null    float64
dtypes: float64(2), int64(2), object(1)
memory usage: 49.5+ KB

In [8]:
df.isnull().sum()#displays the sum of all null values in each column

PassengerId      0
Survived         0
Pclass           0
Name             0
Sex              0
Age            177
SibSp            0
Parch            0
Ticket           0
Fare             0
Cabin          687
Embarked         2
dtype: int64

In [10]:
df.drop("Cabin", axis="columns", inplace = True)#we drop Cabin column coz has lot of null

In [13]:
df.isnull().sum()

PassengerId      0
Survived         0
Pclass           0
Name             0
Sex              0
Age            177
SibSp            0
Parch            0
Ticket           0
Fare             0
Embarked         2
dtype: int64

In [18]:
df.dropna(inplace=True)

In [19]:
df.isnull().sum()

PassengerId    0
Survived       0
Pclass         0
Name           0
Sex            0
Age            0
SibSp          0
Parch          0
Ticket         0
Fare           0
Embarked       0
dtype: int64

In [20]:
df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,S

In [21]:
#lets drop all except survived,sex,age,fare, pclass

In [22]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 712 entries, 0 to 890
Data columns (total 11 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  712 non-null    int64
 1   Survived     712 non-null    int64
 2   Pclass       712 non-null    int64
 3   Name         712 non-null    object
 4   Sex          712 non-null    object
 5   Age          712 non-null    float64
 6   SibSp        712 non-null    int64
 7   Parch        712 non-null    int64
 8   Ticket       712 non-null    object
 9   Fare         712 non-null    float64
 10  Embarked     712 non-null    object
dtypes: float64(2), int64(5), object(4)
memory usage: 66.8+ KB

In [49]:
df.drop(["PassengerId","Name", "SibSp", "Parch", "Ticket","Embarked"], axis="columns", inplace = True)

In [50]:
df

     Survived  Pclass     Sex   Age     Fare
0           0       3    male  22.0   7.2500
1           1       1  female  38.0  71.2833
2           1       3  female  26.0   7.9250
3           1       1  female  35.0  53.1000
4           0       3    male  35.0   8.0500
..        ...     ...     ...   ...      ...
885         0       3  female  39.0  29.1250
886         0       2    male  27.0  13.0000
887         1       1  female  19.0  30.0000
889         1       1    male  26.0  30.0000
890         0       3    male  32.0   7.7500

[712 rows x 5 columns]

In [100]:
X1 = df.drop("Survived", axis="columns")
y = df["Survived"]

In [90]:
inputs.head()

   Pclass     Sex   Age     Fare  Sex_n
0       3    male  22.0   7.2500      0
1       1  female  38.0  71.2833      1
2       3  female  26.0   7.9250      1
3       1  female  35.0  53.1000      1
4       3    male  35.0   8.0500      0

In [91]:
encoded_Sex = LabelEncoder

In [101]:
X1["Sex_n"] = encoded_Sex.fit_transform(X["Sex"], y=(y))

In [65]:
target

0      0
1      1
2      1
3      1
4      0
      ..
885    0
886    0
887    1
889    1
890    0
Name: Survived, Length: 712, dtype: int64

In [69]:
#This transformer should be used to encode target values, *i.e.* `y`, and
#not the input `X`.

In [102]:
X1.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 712 entries, 0 to 890
Data columns (total 5 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Pclass  712 non-null    int64
 1   Sex     712 non-null    object
 2   Age     712 non-null    float64
 3   Fare    712 non-null    float64
 4   Sex_n   712 non-null    int64
dtypes: float64(2), int64(2), object(1)
memory usage: 49.5+ KB

In [103]:
X1

     Pclass     Sex   Age     Fare  Sex_n
0         3    male  22.0   7.2500      0
1         1  female  38.0  71.2833      1
2         3  female  26.0   7.9250      1
3         1  female  35.0  53.1000      1
4         3    male  35.0   8.0500      0
..      ...     ...   ...      ...    ...
885       3  female  39.0  29.1250      0
886       2    male  27.0  13.0000      0
887       1  female  19.0  30.0000      1
889       1    male  26.0  30.0000      1
890       3    male  32.0   7.7500      0

[712 rows x 5 columns]

In [104]:
X = X1.drop("Sex", axis="columns")

In [105]:
X

     Pclass   Age     Fare  Sex_n
0         3  22.0   7.2500      0
1         1  38.0  71.2833      1
2         3  26.0   7.9250      1
3         1  35.0  53.1000      1
4         3  35.0   8.0500      0
..      ...   ...      ...    ...
885       3  39.0  29.1250      0
886       2  27.0  13.0000      0
887       1  19.0  30.0000      1
889       1  26.0  30.0000      1
890       3  32.0   7.7500      0

[712 rows x 4 columns]

In [109]:
model = tree.DecisionTreeClassifier()
X_train, X_test, y_train, y_test = train_test_split(X, y, test_size=0.3, random_state=1)
model.fit(X,y)

DecisionTreeClassifier()

In [121]:
model.score(X, y)

1.0

In [133]:
model.predict([[1,30,10,1]])

/home/wanyoike/.local/lib/python3.8/site-packages/sklearn/base.py:450: UserWarning: X does not have valid feature names, but DecisionTreeClassifier was fitted with feature names
  warnings.warn(

array([1])